## Librerías y Paquetes

In [1]:
import pandas as pd 
import numpy as np

pd.options.display.float_format = '{:,.2f}'.format

## 1. Carga de los dataset

In [9]:
credit_df = pd.read_csv("../data/credit_record.csv")
credit_df

              ID  MONTHS_BALANCE STATUS
0        5001711               0      X
1        5001711              -1      0
2        5001711              -2      0
3        5001711              -3      0
4        5001712               0      C
...          ...             ...    ...
1048570  5150487             -25      C
1048571  5150487             -26      C
1048572  5150487             -27      C
1048573  5150487             -28      C
1048574  5150487             -29      C

[1048575 rows x 3 columns]

In [3]:
application_df = pd.read_csv('../data/application_record.csv')
application_df

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,"427,500.00",Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.00
1,5008805,M,Y,Y,0,"427,500.00",Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.00
2,5008806,M,Y,Y,0,"112,500.00",Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.00
3,5008808,F,N,Y,0,"270,000.00",Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.00
4,5008809,F,N,Y,0,"270,000.00",Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
438552,6840104,M,N,Y,0,"135,000.00",Pensioner,Secondary / secondary special,Separated,House / apartment,-22717,365243,1,0,0,0,NaN,1.00
438553,6840222,F,N,N,0,"103,500.00",Working,Secondary / secondary special,Single / not married,House / apartment,-15939,-3007,1,0,0,0,Laborers,1.00
438554,6841878,F,N,N,0,"54,000.00",Commercial associate,Higher education,Single / not married,With parents,-8169,-372,1,1,0,0,Sales staff,1.00
438555,6842765,F,N,Y,0,"72,000.00",Pensioner,Secondary / secondary special,Married,House / apartment,-21673,365243,1,0,0,0,NaN,2.00
438556,6842885,F,N,Y,0,"121,500.00",Working,Secondary / secondary special,Married,House / apartment,-18858,-1201,1,0,1,0,Sales staff,2.00

## 2. Join de los datos

In [10]:
credit_df.head()

        ID  MONTHS_BALANCE STATUS
0  5001711               0      X
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      C

In [11]:
# Actualizar el valor de la columna status por valores numéricos
credit_df['STATUS'] = credit_df['STATUS'].replace({'X':-2, 'C':-1})
credit_df['STATUS'] = credit_df['STATUS'].astype('int')
credit_df.head()

        ID  MONTHS_BALANCE  STATUS
0  5001711               0      -2
1  5001711              -1       0
2  5001711              -2       0
3  5001711              -3       0
4  5001712               0      -1

In [14]:
# Encontramos el último mes
credit_last_month = credit_df.groupby('ID', as_index=False).agg({'MONTHS_BALANCE': 'max'})
credit_last_month

            ID  MONTHS_BALANCE
0      5001711               0
1      5001712               0
2      5001713               0
3      5001714               0
4      5001715               0
...        ...             ...
45980  5150482             -11
45981  5150483               0
45982  5150484               0
45983  5150485               0
45984  5150487               0

[45985 rows x 2 columns]

In [16]:
# Join para obtener el status del último mes
credit_record = pd.merge(credit_last_month, credit_df, how= 'inner', on= ['ID','MONTHS_BALANCE'] )
credit_record

            ID  MONTHS_BALANCE  STATUS
0      5001711               0      -2
1      5001712               0      -1
2      5001713               0      -2
3      5001714               0      -2
4      5001715               0      -2
...        ...             ...     ...
45980  5150482             -11      -1
45981  5150483               0      -2
45982  5150484               0      -1
45983  5150485               0       0
45984  5150487               0      -1

[45985 rows x 3 columns]

In [24]:
# Join entre aplication y creadit para crear el df final
df = pd.merge(application_df, credit_record, how= 'inner', on= ['ID'])
df

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS,MONTHS_BALANCE,STATUS
0,5008804,M,Y,Y,0,"427,500.00",Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.00,0,-1
1,5008805,M,Y,Y,0,"427,500.00",Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.00,0,-1
2,5008806,M,Y,Y,0,"112,500.00",Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.00,0,-1
3,5008808,F,N,Y,0,"270,000.00",Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.00,0,0
4,5008809,F,N,Y,0,"270,000.00",Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.00,-22,-2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
36452,5149828,M,Y,Y,0,"315,000.00",Working,Secondary / secondary special,Married,House / apartment,-17348,-2420,1,0,0,0,Managers,2.00,0,5
36453,5149834,F,N,Y,0,"157,500.00",Commercial associate,Higher education,Married,House / apartment,-12387,-1325,1,0,1,1,Medicine staff,2.00,0,-1
36454,5149838,F,N,Y,0,"157,500.00",Pensioner,Higher education,Married,House / apartment,-12387,-1325,1,0,1,1,Medicine staff,2.00,0,-1
36455,5150049,F,N,Y,0,"283,500.00",Working,Secondary / secondary special,Married,House / apartment,-17958,-655,1,0,0,0,Sales staff,2.00,0,2
36456,5150337,M,N,Y,0,"112,500.00",Working,Secondary / secondary special,Single / not married,Rented apartment,-9188,-1193,1,0,0,0,Laborers,1.00,0,0

## 2. EDA

In [18]:
df.head(10)

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS,MONTHS_BALANCE,STATUS
0,5008804,M,Y,Y,0,"427,500.00",Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.00,0,-1
1,5008805,M,Y,Y,0,"427,500.00",Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.00,0,-1
2,5008806,M,Y,Y,0,"112,500.00",Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.00,0,-1
3,5008808,F,N,Y,0,"270,000.00",Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.00,0,0
4,5008809,F,N,Y,0,"270,000.00",Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.00,-22,-2
5,5008810,F,N,Y,0,"270,000.00",Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.00,0,-1
6,5008811,F,N,Y,0,"270,000.00",Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.00,0,-1
7,5008812,F,N,Y,0,"283,500.00",Pensioner,Higher education,Separated,House / apartment,-22464,365243,1,0,0,0,NaN,1.00,-4,0
8,5008813,F,N,Y,0,"283,500.00",Pensioner,Higher education,Separated,House / apartment,-22464,365243,1,0,0,0,NaN,1.00,0,0
9,5008814,F,N,Y,0,"283,500.00",Pensioner,Higher education,Separated,House / apartment,-22464,365243,1,0,0,0,NaN,1.00,-1,0

In [26]:
# Renombramos las columnas
df.columns = map(str.lower, df.columns)
df = df.rename(columns= {'id': 'id',
                'code_gender': 'gender',
                'flag_own_car': 'car',
                'flag_own_realty': 'property',
                'cnt_children': 'children',
                'amt_income_total': 'annual_income',
                'name_income_type': 'income_type',
                'name_education_type': 'education_type',
                'name_family_status': 'family_status',
                'name_housing_type': 'housing_type',
                'days_birth': 'birth_date',
                'days_employed': 'employment',
                'flag_mobil': 'mobile_phone',
                'flag_work_phone': 'work_phone',
                'flag_phone': 'phone',
                'flag_email': 'email',
                'occupation_type': 'occupation_type',
                'cnt_fam_members': 'fam_members',
                'months_balance': 'months_balance',
                'status': 'status'})
df.head(10)

,id,gender,car,property,children,annual_income,income_type,education_type,family_status,housing_type,birth_date,employment,mobile_phone,work_phone,phone,email,occupation_type,fam_members,months_balance,status
0,5008804,M,Y,Y,0,"427,500.00",Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.00,0,-1
1,5008805,M,Y,Y,0,"427,500.00",Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.00,0,-1
2,5008806,M,Y,Y,0,"112,500.00",Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.00,0,-1
3,5008808,F,N,Y,0,"270,000.00",Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.00,0,0
4,5008809,F,N,Y,0,"270,000.00",Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.00,-22,-2
5,5008810,F,N,Y,0,"270,000.00",Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.00,0,-1
6,5008811,F,N,Y,0,"270,000.00",Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.00,0,-1
7,5008812,F,N,Y,0,"283,500.00",Pensioner,Higher education,Separated,House / apartment,-22464,365243,1,0,0,0,NaN,1.00,-4,0
8,5008813,F,N,Y,0,"283,500.00",Pensioner,Higher education,Separated,House / apartment,-22464,365243,1,0,0,0,NaN,1.00,0,0
9,5008814,F,N,Y,0,"283,500.00",Pensioner,Higher education,Separated,House / apartment,-22464,365243,1,0,0,0,NaN,1.00,-1,0

In [27]:
len(df)

36457

In [29]:
# Validamos el número de nulos en el df
df.isna().sum()

id                     0
gender                 0
car                    0
property               0
children               0
annual_income          0
income_type            0
education_type         0
family_status          0
housing_type           0
birth_date             0
employment             0
mobile_phone           0
work_phone             0
phone                  0
email                  0
occupation_type    11323
fam_members            0
months_balance         0
status                 0
dtype: int64

In [30]:
# Rename de occupation that are nulls
df['occupation_type'] = df['occupation_type'].fillna('Others')

In [31]:
# Set the birth date and employment as positive values
df['age'] = df['birth_date'].apply(lambda x: round(x/-365, 0))
df['year_of_employment'] = df['employment'].apply(lambda x: round(x/-365, 0) if x< 0 else 0)

df = df.drop(columns=['birth_date','employment'])

In [32]:
# Análisis del tipo de datos
df.dtypes

id                      int64
gender                 object
car                    object
property               object
children                int64
annual_income         float64
income_type            object
education_type         object
family_status          object
housing_type           object
mobile_phone            int64
work_phone              int64
phone                   int64
email                   int64
occupation_type        object
fam_members           float64
months_balance          int64
status                  int32
age                   float64
year_of_employment    float64
dtype: object

In [35]:
# Análisis de variables numéricas
df[['annual_income','fam_members', 'age', 'year_of_employment']].describe()

       annual_income  fam_members       age  year_of_employment
count      36,457.00    36,457.00 36,457.00           36,457.00
mean      186,685.74         2.20     43.78                6.04
std       101,789.23         0.91     11.52                6.49
min        27,000.00         1.00     21.00                0.00
25%       121,500.00         2.00     34.00                1.00
50%       157,500.00         2.00     43.00                4.00
75%       225,000.00         3.00     53.00                9.00
max     1,575,000.00        20.00     69.00               43.00

In [36]:
# Análisis de variable categóricas
for column in ['CODE_GENDER','FLAG_OWN_CAR','FLAG_OWN_REALTY','NAME_INCOME_TYPE','NAME_EDUCATION_TYPE','NAME_FAMILY_STATUS','NAME_HOUSING_TYPE','FLAG_MOBIL','FLAG_WORK_PHONE','FLAG_PHONE','FLAG_EMAIL']:
    print('--------------------')
    print(application_df[column].value_counts())

--------------------
F    294440
M    144117
Name: CODE_GENDER, dtype: int64
--------------------
N    275459
Y    163098
Name: FLAG_OWN_CAR, dtype: int64
--------------------
Y    304074
N    134483
Name: FLAG_OWN_REALTY, dtype: int64
--------------------
Working                 226104
Commercial associate    100757
Pensioner                75493
State servant            36186
Student                     17
Name: NAME_INCOME_TYPE, dtype: int64
--------------------
Secondary / secondary special    301821
Higher education                 117522
Incomplete higher                 14851
Lower secondary                    4051
Academic degree                     312
Name: NAME_EDUCATION_TYPE, dtype: int64
--------------------
Married                 299828
Single / not married     55271
Civil marriage           36532
Separated                27251
Widow                    19675
Name: NAME_FAMILY_STATUS, dtype: int64
--------------------
House / apartment      393831
With parents            19077
Municipal apartment     14214
Rented apartment         5974
Office apartment         3922
Co-op apartment          1539
Name: NAME_HOUSING_TYPE, dtype: int64
--------------------
1    438557
Name: FLAG_MOBIL, dtype: int64
--------------------
0    348156
1     90401
Name: FLAG_WORK_PHONE, dtype: int64
--------------------
0    312353
1    126204
Name: FLAG_PHONE, dtype: int64
--------------------
0    391102
1     47455
Name: FLAG_EMAIL, dtype: int64